In [2]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

baseurl = "https://www.thewhiskyexchange.com"

headers = {'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/89.0.4389.82 Safari/537.36'}
productlinks = []
t={}
data=[]
c=0
for x in range(1,6):
    k = requests.get('https://www.thewhiskyexchange.com/c/35/japanese-whisky?pg={}&psize=24&sort=pasc'.format(x)).text
    soup=BeautifulSoup(k,'html.parser')
    productlist = soup.find_all("li",{"class":"product-grid__item"})


    for product in productlist:
        link = product.find("a",{"class":"product-card"}).get('href')
        productlinks.append(baseurl + link)


for link in productlinks:
    f = requests.get(link,headers=headers).text
    hun=BeautifulSoup(f,'html.parser')

    try:
        price=hun.find("p",{"class":"product-action__price"}).text.replace('\n',"")
    except:
        price = None

    try:
        about=hun.find("div",{"class":"product-main__description"}).text.replace('\n',"")
    except:
        about=None

    try:
        rating = hun.find("div",{"class":"review-overview"}).text.replace('\n',"")
    except:
        rating=None

    try:
        name=hun.find("h1",{"class":"product-main__name"}).text.replace('\n',"")
    except:
        name=None

    whisky = {"name":name,"price":price,"rating":rating,"about":about}

    data.append(whisky)
    c=c+1
    print("completed",c)

df = pd.DataFrame(data)

print(df)

completed 1
completed 2
completed 3
completed 4
completed 5
completed 6
completed 7
completed 8
completed 9
completed 10
completed 11
completed 12
completed 13
completed 14
completed 15
completed 16
completed 17
completed 18
completed 19
completed 20
completed 21
completed 22
completed 23
completed 24
completed 25
completed 26
completed 27
completed 28
completed 29
completed 30
completed 31
completed 32
completed 33
completed 34
completed 35
completed 36
completed 37
completed 38
completed 39
completed 40
completed 41
completed 42
completed 43
completed 44
completed 45
completed 46
completed 47
completed 48
completed 49
completed 50
completed 51
completed 52
completed 53
completed 54
completed 55
completed 56
completed 57
completed 58
completed 59
completed 60
completed 61
completed 62
completed 63
completed 64
completed 65
completed 66
completed 67
completed 68
completed 69
completed 70
completed 71
completed 72
completed 73
completed 74
completed 75
completed 76
completed 77
completed 78
completed 79
completed 80
completed 81
completed 82
completed 83
completed 84
completed 85
completed 86
completed 87
completed 88
completed 89
completed 90
completed 91
completed 92
completed 93
completed 94
completed 95
completed 96
completed 97
completed 98
completed 99
completed 100
completed 101
completed 102
completed 103
completed 104
completed 105
completed 106
completed 107
completed 108
completed 109
completed 110
completed 111
completed 112
completed 113
completed 114
completed 115
                                                  name    price  \
0                                Suntory Torys Classic   £30.45
1                                         Suntory Toki   £31.95
2                            Nikka Coffey Grain Whisky   £56.95
3                          Hakushu Distiller's Reserve   £66.95
4                            Akashi Single Malt Whisky   £73.75
..                                                 ...      ...
110                                 Yoichi 20 Year Old   £3,000
111                            Chichibu 2010Cask #1000   £3,250
112  Chichibu 200910 Year Old Artist International ...   £3,500
113                    Karuizawa 1981Sherry Cask #6056  £13,500
114               Hanyu 1985 The JokerMonochrome Label  £60,000

              rating                                              about
0     3.5(2 Reviews)  Suntory Torys Classic is a light and easy-drin...
1      4(33 Reviews)  Toki is a blended whisky from Suntory's three ...
2    4.5(51 Reviews)  A release of grain whisky from Japan's Nikka, ...
3    4.5(28 Reviews)  A green and crunchy entry in the Hakushu Range...
4        5(1 Review)  Akashi Single Malt Whisky is made at the White...
..               ...                                                ...
110     5(3 Reviews)  A powerful cask-strength 20-year-old single ma...
111             None  A limited edition Japanese single malt from Ch...
112             None
113             None  An incredibly intense 1981 vintage bottling fr...
114             None  The last and final release from the Ichiro's M...

[115 rows x 4 columns]

In [7]:
df.to_csv("scraped_data.csv")

In [9]:
import mysql.connector as conn

In [17]:
mydb = conn.connect(
    host = "localhost",
    user = "root",
    password = "kunaal099",
    database = "scraped"
)

In [18]:
cursor = mydb.cursor(buffered = True)

In [19]:
pd.read_sql("show databases",mydb)

             Database
0             dataset
1             entries
2  information_schema
3               mysql
4            new_data
5  performance_schema
6              sakila
7             scraped
8             student
9                 sys

In [23]:
# pd.read_sql("use scraped",mydb)
df.head(1)

,name,price,rating,about
0,Suntory Torys Classic,£30.45,3.5(2 Reviews),Suntory Torys Classic is a light and easy-drin...

In [28]:
# pd.read_sql("create table products (name text, price varchar(7),rating varchar(20),about text)",mydb)

In [31]:
pd.read_sql("select * from products",mydb)

Empty DataFrame
Columns: [name, price, rating, about]
Index: []

In [43]:
df.columns

Index(['name', 'price', 'rating', 'about'], dtype='object')

In [50]:
df.to_csv("ScrapedData.csv")

In [85]:
# import csv
# with open("ScrapedData.csv","r") as f:
#     data = csv.reader(f,delimiter = "\n")
#     for i in data:
#         print(i)
#         print(f"insert into scraper:")
#         pd.read_sql(f"insert into scraped.data values({str(i[0])})",mydb)

In [84]:
# var=pd.read_csv("ScrapedData.csv",usecols=["id","name","rating","about"])

In [76]:
var.isnull().sum()

id        0
name      0
rating    0
about     0
dtype: int64

In [77]:
var = var.fillna("value dont exist here")

In [78]:
var.isnull().sum()

id        0
name      0
rating    0
about     0
dtype: int64

In [100]:
# !pip install pymysql
import pymysql 
engine = create_engine('mysql+pymysql://root:kunaal099@localhost/scraper')

# engine = create_engine("mysql+pymysql://" + Cfg.username + ":" + Cfg.password + "@" + Cfg.host + "/" + Cfg.database)
var.to_sql('SData',mydb, if_exists = 'replace',index = False, chunksize = 1000)

NameError: name 'create_engine' is not defined

In [98]:
# import csv
# with open("SData.csv","r") as f:
#     data = csv.reader(f,delimiter = "\n")
#     for i in data:
#         print(i)
#         print(f"insert into scraper:")
#         pd.read_sql(f"insert into scraped.products(id,name,rating,about) values({str(i[0])})",mydb)